def area(a):
    '''
    Вычисляет площадь квадрата по заданной длине стороны.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            (float): площадь квадрата

        Пример вызова:
            >> area(5)
            25
    '''
    return a * a


def perimeter(a):
    '''
    Вычисляет периметр квадрата по заданной длине стороны.

        Параметры:
            a (float): длина стороны квадрата

        Возвращаемое значение:
            (float): периметр квадрата

        Пример вызова:
            >> perimeter(5)
            20
    '''
    return 4 * a
